// Масиви та об'єкти:
// - Створити масив, наповнити його 10 елементами будь-якого типу, вивести кожен елемент в консоль
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre.
// - Створити 3 об'єкти які описують книги. Поля об'єкту : title ,pageCount, genre, authors. Поле "автори" - являється  масивом.
// Кожен автор має поля name та age.
// - Створити масив з 10 об'єктами які описують сутніть "користувач". Поля: name, username,password. Вивести в консоль пароль кожного користувача

// let arr1 = [true, false, 1, 2, 'sd', 'sdfaqs']
// console.log(arr1[0], arr1[1], arr1[2], arr1[3], arr1[4], arr1[5])
//
// let book1 = {
//     title: '1',
//     pageCount: 200,
//     genre: 'fantasy'
// }
// console.log(book1)
//
// let book2 = {
//     title: '1',
//     pageCount: 200,
//     genre: 'fantasy',
//     authors: [
//         {
//             name: 'one',
//             age: 20,
//         },
//         {
//             name: 'two',
//             age: 30
//         }
//     ]
// }
// console.log(book2.title)
// console.log(book2.authors[1].name)
// console.log(book2.authors)


// Логічні розгалуження:
//     - Є змінна х, якій ви надаєте довільне числове значення.
//     Якщо змінна x не дорівнює нулю, виведіть 'Вірно', інакше виведіть 'Невірно'. Перевірте  скрипт при a, що дорівнює 1, 0, -3

// let x = 1
//
// if (x !== 0) {
//     console.log('вірно')
// } else {
//     console.log('невірно')
// }

// - Дано змінну time яка рівна числу від 0 до 59. Потрібно написати код, який перевірить, до якої четверті години попадає число
// (в першу, другу, третю или четверту частину години).

// - У змінній day дано якесь число від 1 до 31. Потрібно визначити, у яку половину(декаду) місяця потрапляє це число (у першу, другу чи третю).
// - Скласти розклад на тиждень за домопоги switch. Користувач вводить порядковий номер дня тижня і на екрані відображається інфа
// що заплановано на цей день (можна замість плану на день, назву дня англійською).
//     - Користувач вводить або має два числа.
//         Потрібно знайти та вивести максимальне число з тих двох .
//         Також потрібно врахувати коли введені рівні числа.

// let a = 2
// let b = 2
//
// if (a>b) {
//     console.log(a)
// } else if (b>a) {
//     console.log(b)
// } else {
//     console.log('equal')
// }

//
//   - є змінна х, яка може прийняти будь-яке значення (стрінг, число, undefined, null  і тд включно). Напишіть код який,
//      за допомоги  оператора || буде присвоювати змінній х значення "default"  якщо значення змінної х являється falsy (хибноподібні,
//       тобто приводиться до false)

let x = ''
let res = x || 'default'
if (res) {
    console.log(res)
} else {
    console.log('error')
}

//
//   - з файлу arrays.js (лежить в папці 2023 plan ) взяти масив coursesAndDurationArray. За допомоги іф перевірити
//   кожен його елемент на тривалість навчання. У випадку якщо тривалість довша за 5 місяців вивести в консоль "Супер".